Seems to work, I expect this to be rolled out in our upcoming `4.12.0` release.

```bash
bruno@pop-os ~/D/t/24392> terraform apply -auto-approve                                                                                                                                                   (base) 
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/aws in /home/bruno/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_key.key will be created
  + resource "aws_kms_key" "key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "HMAC_256"
      + description                        = (known after apply)
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "GENERATE_VERIFY_MAC"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_kms_key.key: Creating...
aws_kms_key.key: Creation complete after 1s [id=xxxxxxa6-b9ec-xxfd-862c-xxxc059f5xxx]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

![image](https://user-images.githubusercontent.com/58337159/165250571-e8d47919-4c92-4e03-9616-9e01ff7236c4.png)
